
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <title>Introduction · Scala研修テキスト</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.1.1">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-anchors/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="introduction-to-scala.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="introduction-to-scala.html">
            
                <a href="introduction-to-scala.html">
            
                    
                    Scalaとは
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="sbt-install.html">
            
                <a href="sbt-install.html">
            
                    
                    sbtをインストールする
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="basic.html">
            
                <a href="basic.html">
            
                    
                    Scalaの基本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="sbt-compile-execute.html">
            
                <a href="sbt-compile-execute.html">
            
                    
                    sbtでプログラムをコンパイル・実行する
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="IDE.html">
            
                <a href="IDE.html">
            
                    
                    IDE(Intellij IDEA)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="control-syntax.html">
            
                <a href="control-syntax.html">
            
                    
                    Scalaの制御構文
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="class.html">
            
                <a href="class.html">
            
                    
                    クラス
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="object.html">
            
                <a href="object.html">
            
                    
                    オブジェクト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="trait.html">
            
                <a href="trait.html">
            
                    
                    トレイト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="type-parameter.html">
            
                <a href="type-parameter.html">
            
                    
                    型パラメータと変位指定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="function.html">
            
                <a href="function.html">
            
                    
                    関数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="collection.html">
            
                <a href="collection.html">
            
                    
                    Scalaのコレクションライブラリ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="case-class-and-pattern-matching.html">
            
                <a href="case-class-and-pattern-matching.html">
            
                    
                    ケースクラスとパターンマッチング
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="error-handling.html">
            
                <a href="error-handling.html">
            
                    
                    エラー処理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="implicit.html">
            
                <a href="implicit.html">
            
                    
                    Implicit
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="typeclass.html">
            
                <a href="typeclass.html">
            
                    
                    型クラスの紹介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="future-and-promise.html">
            
                <a href="future-and-promise.html">
            
                    
                    FutureとPromise
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="test.html">
            
                <a href="test.html">
            
                    
                    テスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="java-interop.html">
            
                <a href="java-interop.html">
            
                    
                    Javaとの相互運用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="exercises.html">
            
                <a href="exercises.html">
            
                    
                    S99の案内
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="advanced-trait-di.html">
            
                <a href="advanced-trait-di.html">
            
                    
                    トレイトの応用編：依存性の注入によるリファクタリング
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Introduction</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x306F;&#x3058;&#x3081;&#x306B;"><a name="&#x306F;&#x3058;&#x3081;&#x306B;" class="plugin-anchor" href="#&#x306F;&#x3058;&#x3081;&#x306B;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x306F;&#x3058;&#x3081;&#x306B;</h1>
<p>&#x672C;&#x8CC7;&#x6599;&#x306F;&#x3001;&#x30C9;&#x30EF;&#x30F3;&#x30B4;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;&#x3001;&#x65B0;&#x5352;&#x30A8;&#x30F3;&#x30B8;&#x30CB;&#x30A2;&#x5411;&#x3051;&#x306E;&#x7814;&#x4FEE;&#x8CC7;&#x6599;&#x3067;&#x3059;&#x3002;</p>
<p>&#x672C;&#x8CC7;&#x6599;&#x3092;&#x7528;&#x3044;&#x305F;&#x8B1B;&#x7FA9;&#x3092;&#x53D7;&#x8B1B;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;</p>
<ul>
<li>&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x8A00;&#x8A9E;Scala&#x3092;&#x7528;&#x3044;&#x305F;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x958B;&#x767A;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308B;&#x3053;&#x3068;</li>
<li><a href="http://book.impress.co.jp/books/3084" target="_blank">&#x300E;Scala &#x30B9;&#x30B1;&#x30FC;&#x30E9;&#x30D6;&#x30EB;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x300F;&#xFF08;&#x7B2C;&#x4E8C;&#x7248;&#xFF09;</a>&#xFF08;&#x901A;&#x79F0;&#x30B3;&#x30C3;&#x30D7;&#x672C;&#xFF09;&#x3092;&#x901A;&#x8AAD;&#x3057;&#x3066;&#x7406;&#x89E3;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308B;&#x3053;&#x3068;</li>
<li><a href="http://book.impress.co.jp/books/1114101091" target="_blank">&#x300E;Scala&#x95A2;&#x6570;&#x578B;&#x30C7;&#x30B6;&#x30A4;&#x30F3;&amp;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0; &#x2015;Scalaz&#x30B3;&#x30F3;&#x30C8;&#x30EA;&#x30D3;&#x30E5;&#x30FC;&#x30BF;&#x30FC;&#x306B;&#x3088;&#x308B;&#x95A2;&#x6570;&#x578B;&#x5FB9;&#x5E95;&#x30AC;&#x30A4;&#x30C9;&#x300F;</a>&#xFF08;&#x901A;&#x79F0;FP in Scala&#xFF09;&#x3092;&#x901A;&#x8AAD;&#x3057;&#x3066;&#x7406;&#x89E3;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308B;&#x3053;&#x3068;</li>
</ul>
<p>&#x304C;&#x4E3B;&#x306A;&#x76EE;&#x7684;&#x3067;&#x3059;&#x3002;</p>
<p>&#x300E;Scala&#x30B9;&#x30B1;&#x30FC;&#x30E9;&#x30D6;&#x30EB;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x300F;&#x306F;&#x3001;Scala&#x306E;&#x8A00;&#x8A9E;&#x8A2D;&#x8A08;&#x8005;&#x3067;&#x3042;&#x308B;Odersky&#x3055;&#x3093;&#x3089;&#x306B;&#x3088;&#x308A;&#x66F8;&#x304B;&#x308C;&#x305F;&#x89E3;&#x8AAC;&#x66F8;&#x3067;&#x3001;Scala&#x306E;&#x8A00;&#x8A9E;&#x6A5F;&#x80FD;&#x306B;&#x3064;&#x3044;&#x3066;&#x8A73;&#x7D30;&#x306B;&#x66F8;&#x304B;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;Scala&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DE;&#x306B;&#x3068;&#x3063;&#x3066;&#x306F;&#x30D0;&#x30A4;&#x30D6;&#x30EB;&#x3068;&#x8A00;&#x3048;&#x308B;&#x672C;&#x3067;&#x3059;&#x3002;&#x7B2C;2&#x7248;&#x306E;&#x5185;&#x5BB9;&#x306F;Scala 2.8&#x304C;&#x5BFE;&#x8C61;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x3082;&#x306E;&#x306E;&#x3001;&#x307B;&#x3068;&#x3093;&#x3069;&#x306E;&#x8A18;&#x8FF0;&#x306F;&#x73FE;&#x5728;&#x3067;&#x3082;&#x5F79;&#x306B;&#x7ACB;&#x3064;&#x3082;&#x306E;&#x3067;&#x3059;<sup><a href="#fn_1" id="reffn_1">1</a></sup>&#x3002;&#x3053;&#x306E;&#x672C;&#x306F;&#x6C7A;&#x3057;&#x3066;&#x8AAD;&#x307F;&#x306B;&#x304F;&#x3044;&#x672C;&#x3067;&#x306F;&#x306A;&#x3044;&#x306E;&#x3067;&#x3059;&#x304C;&#x3001;&#x672C;&#x306E;&#x5206;&#x91CF;&#x304C;&#x591A;&#x3044;&#x306E;&#x3068;&#x3001;&#x95A2;&#x6570;&#x578B;&#x306A;&#x3069;&#x4ED6;&#x306E;&#x8A00;&#x8A9E;&#x3067;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x7D4C;&#x9A13;&#x304C;&#x306A;&#x3044;&#x3068;&#x308F;&#x304B;&#x308A;&#x306B;&#x304F;&#x3044;&#x7B87;&#x6240;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x672C;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3092;&#x901A;&#x3058;&#x3066;Scala&#x306B;&#x5165;&#x9580;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x3088;&#x3063;&#x3066;&#x3001;&#x3053;&#x306E;&#x300E;&#x30B3;&#x30C3;&#x30D7;&#x672C;&#x300F;&#x3082;&#x8AAD;&#x307F;&#x3084;&#x3059;&#x304F;&#x306A;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;</p>
<p>&#x300E;Scala&#x95A2;&#x6570;&#x578B;&#x30C7;&#x30B6;&#x30A4;&#x30F3;&amp;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x300F;&#x306F;&#x3001;<a href="https://github.com/scalaz/scalaz" target="_blank">Scalaz</a><sup><a href="#fn_2" id="reffn_2">2</a></sup>&#x30B3;&#x30F3;&#x30C8;&#x30EA;&#x30D3;&#x30E5;&#x30FC;&#x30BF;&#x30FC;&#x3067;&#x3042;&#x308B;Paul Chiusano&#x3055;&#x3093;&#x3001;R&#xFA;nar Bjarnason&#x3055;&#x3093;&#x3089;&#x306B;&#x3088;&#x308A;&#x66F8;&#x304B;&#x308C;&#x305F;&#x95A2;&#x6570;&#x578B;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x306B;&#x3064;&#x3044;&#x3066;&#x306E;&#x672C;&#x3067;&#x3059;&#x3002;&#x3042;&#x304F;&#x307E;&#x3067;&#x95A2;&#x6570;&#x578B;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x306E;&#x672C;&#x306A;&#x306E;&#x3067;Scala&#x3084;Scalaz&#x306B;&#x3064;&#x3044;&#x3066;&#x306E;&#x89E3;&#x8AAC;&#x306F;&#x3042;&#x307E;&#x308A;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x305F;&#x3060;&#x3057;Scala&#x306B;&#x3064;&#x3044;&#x3066;&#x306E;&#x6700;&#x4F4E;&#x9650;&#x306E;&#x6587;&#x6CD5;&#x306E;&#x8AAC;&#x660E;&#x306F;&#x968F;&#x6642;&#x884C;&#x308F;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x300C;&#x672C;&#x6587;&#x4E2D;&#x3067;&#x4E00;&#x304B;&#x3089;&#x81EA;&#x4F5C;&#x300D;&#x3068;&#x3044;&#x3046;&#x30B9;&#x30BF;&#x30F3;&#x30B9;&#x304C;&#x5FB9;&#x5E95;&#x3055;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;&#x578B;&#x30AF;&#x30E9;&#x30B9;&#x306E;&#x307F;&#x306A;&#x3089;&#x305A;&#x3001;List&#x3001;Stream&#x3001;Future&#x306A;&#x3069;&#x3001;Scala&#x6A19;&#x6E96;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x306B;&#x5B58;&#x5728;&#x3059;&#x308B;&#x3082;&#x306E;&#x307E;&#x3067;&#x3001;&#x4E00;&#x304B;&#x3089;&#x81EA;&#x4F5C;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x300C;&#x5358;&#x306B;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x3092;&#x899A;&#x3048;&#x3066;&#x4F7F;&#x3046;&#x300D;&#x306E;&#x3067;&#x306F;&#x306A;&#x304F;&#x3001;&#x305D;&#x308C;&#x305E;&#x308C;&#x306E;&#x95A2;&#x6570;&#x578B;&#x306E;&#x8272;&#x3005;&#x306A;&#x578B;&#x30AF;&#x30E9;&#x30B9;&#x3084;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x304C;&#x300C;&#x306A;&#x305C;&#x305D;&#x3046;&#x3044;&#x3046;&#x4ED5;&#x7D44;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x3068;&#x3044;&#x3046;&#x6839;&#x672C;&#x7684;&#x306A;&#x8003;&#x3048;&#x65B9;&#x304B;&#x3089;&#x8AAC;&#x660E;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x7D30;&#x304B;&#x3044;Scala&#x81EA;&#x4F53;&#x306E;&#x8A00;&#x8A9E;&#x4ED5;&#x69D8;&#x3084;&#x30C6;&#x30AF;&#x30CB;&#x30C3;&#x30AF;&#x3001;&#xFF08;&#x6A19;&#x6E96;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x3068;&#x5916;&#x90E8;&#x306E;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x542B;&#x3081;&#x305F;&#xFF09;&#x65E2;&#x5B58;&#x306E;&#x5B9F;&#x5728;&#x3059;&#x308B;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x306E;&#x4F7F;&#x3044;&#x65B9;&#x306F;&#x4E00;&#x5207;&#x8AAC;&#x660E;&#x305B;&#x305A;&#x3001;&#x3068;&#x306B;&#x304B;&#x304F;&#x300C;&#x8003;&#x3048;&#x65B9;&#x3084;&#x6982;&#x5FF5;&#x300D;&#x306E;&#x307F;&#x3092;&#x91CD;&#x70B9;&#x7684;&#x306B;&#x8AAC;&#x660E;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x3001;&#x3053;&#x306E;&#x672C;&#x3092;&#x8AAD;&#x3093;&#x3067;&#x8EAB;&#x306B;&#x3064;&#x3051;&#x305F;&#x77E5;&#x8B58;&#x306F;&#x53E4;&#x304F;&#x306A;&#x308A;&#x306B;&#x304F;&#x3044;&#x3068;&#x3044;&#x3046;&#x70B9;&#x3067;&#x304A;&#x3059;&#x3059;&#x3081;&#x3067;&#x304D;&#x308B;&#x4E00;&#x518A;&#x3067;&#x3059;&#x3002;</p>
<p>&#x8AAD;&#x8005;&#x5C64;&#x3068;&#x3057;&#x3066;&#x306F;&#x3001;</p>
<ul>
<li>&#x5927;&#x5B66;&#x306E;&#x60C5;&#x5831;&#x5B66;&#x90E8;&#x5352;&#x3067;&#x3042;&#x308B;</li>
<li>Java&#x3084;C&#x306A;&#x3069;&#x3001;1&#x3064;&#x4EE5;&#x4E0A;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x8A00;&#x8A9E;&#x306E;&#x8B1B;&#x7FD2;&#x3092;&#x53D7;&#x3051;&#x3066;&#x3044;&#x308B;</li>
<li>&#x4F55;&#x304B;&#x610F;&#x5473;&#x306E;&#x3042;&#x308B;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F5C;&#x3063;&#x305F;&#x3053;&#x3068;&#x304C;&#x3042;&#x308B;</li>
<li>&#x8DA3;&#x5473;&#x3067;Twitter API&#x306A;&#x3069;&#x3092;&#x89E6;&#x3063;&#x305F;&#x308A;&#x3001;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x3092;&#x884C;&#x3063;&#x3066;&#x3044;&#x308B;</li>
</ul>
<p>&#x4EBA;&#xFF08;&#x76F8;&#x5F53;&#xFF09;&#x3092;&#x4EEE;&#x5B9A;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x306A;&#x304A;&#x3001;&#x4E0A;&#x8A18;&#x306E;&#x6307;&#x6A19;&#x306F;&#x3053;&#x306E;&#x8CC7;&#x6599;&#x3092;&#x8AAD;&#x3080;&#x306B;&#x3042;&#x305F;&#x3063;&#x3066;&#x306E;&#x3042;&#x304F;&#x307E;&#x3067;&#x76EE;&#x5B89;&#x3067;&#x3042;&#x308A;&#x3001;&#x7279;&#x306B;&#x5927;&#x5B66;&#x306E;&#x60C5;&#x5831;&#x5B66;&#x90E8;&#x5352;&#x3067;&#x306A;&#x3051;&#x308C;&#x3070;&#x7406;&#x89E3;&#x3067;&#x304D;&#x306A;&#x3044;&#x3068;&#x3044;&#x3063;&#x305F;&#x3053;&#x3068;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x305F;&#x3060;&#x3057;&#x3001;&#x672C;&#x8CC7;&#x6599;&#x306F;1&#x3064;&#x4EE5;&#x4E0A;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x8A00;&#x8A9E;&#x3067;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F5C;&#x308C;&#x308B;&#x3053;&#x3068;&#x3092;&#x6700;&#x4F4E;&#x9650;&#x306E;&#x524D;&#x63D0;&#x306B;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x306E;&#x3067;&#x3001;&#x305D;&#x306E;&#x70B9;&#x7559;&#x610F;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</p>
<h2 id="&#x2605;&#x30DE;&#x30FC;&#x30AF;&#x306B;&#x3064;&#x3044;&#x3066;"><a name="&#x2605;&#x30DE;&#x30FC;&#x30AF;&#x306B;&#x3064;&#x3044;&#x3066;" class="plugin-anchor" href="#&#x2605;&#x30DE;&#x30FC;&#x30AF;&#x306B;&#x3064;&#x3044;&#x3066;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x2605;&#x30DE;&#x30FC;&#x30AF;&#x306B;&#x3064;&#x3044;&#x3066;</h2>
<p>&#x672C;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3067;&#x306F;&#x3001;&#x7BC0;&#x3084;&#x9805;&#x3054;&#x3068;&#x306B;&#x3001;&#x3069;&#x306E;&#x7A0B;&#x5EA6;&#x91CD;&#x8981;&#x304B;&#x3092;&#x793A;&#x3059;&#x305F;&#x3081;&#x306B;&#x2605;&#x30DE;&#x30FC;&#x30AF;&#x3092;&#x4ED8;&#x3051;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x4EE5;&#x4E0B;&#x306B;&#x57FA;&#x6E96;&#x3092;&#x793A;&#x3057;&#x307E;&#x3059;&#x306E;&#x3067;&#x3001;&#x53C2;&#x8003;&#x306B;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</p>
<ul>
<li>&#x2605;&#x2605;&#x2605;&#xFF1A; &#x5FC5;&#x305A;&#x8AAD;&#x3080;&#x3079;&#x304D;&#xFF08;must&#xFF09;</li>
<li>&#x2605;&#x2605;&#xFF1A;&#x8AAD;&#x3093;&#x3060;&#x65B9;&#x304C;&#x3044;&#x3044;&#xFF08;should&#xFF09;</li>
<li>&#x2605;&#xFF1A;&#x8AAD;&#x3080;&#x3068;&#x3044;&#x3044;&#x304B;&#x3082;&#xFF08;may&#xFF09;</li>
</ul>
<h2 id="&#x30E9;&#x30A4;&#x30BB;&#x30F3;&#x30B9;"><a name="&#x30E9;&#x30A4;&#x30BB;&#x30F3;&#x30B9;" class="plugin-anchor" href="#&#x30E9;&#x30A4;&#x30BB;&#x30F3;&#x30B9;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x30E9;&#x30A4;&#x30BB;&#x30F3;&#x30B9;</h2>
<p>&#x672C;&#x6587;&#x66F8;&#x306F;&#x3001;<a href="https://creativecommons.org/licenses/by-nc-sa/3.0/deed.ja" target="_blank">CC BY-NC-SA 3.0</a></p>
<p><img src="https://licensebuttons.net/l/by-nc-sa/3.0/88x31.png" alt="CC-BY-NC-SA"></p>
<p>&#x306E;&#x5143;&#x3067;&#x914D;&#x5E03;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<blockquote id="fn_1">
<sup>1</sup>. &#x539F;&#x8457;&#x3067;&#x306F;Scala 2.12&#x306B;&#x5BFE;&#x5FDC;&#x3057;&#x305F;&#x7B2C;3&#x7248;&#x304C;&#x51FA;&#x7248;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002; <a href="http://www.artima.com/shop/programming_in_scala_3ed" target="_blank">http://www.artima.com/shop/programming_in_scala_3ed</a><a href="#reffn_1" title="Jump back to footnote [1] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_2">
<sup>2</sup>. &#x95A2;&#x6570;&#x578B;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x3092;&#x884C;&#x3046;&#x305F;&#x3081;&#x306E;&#x7D14;&#x7C8B;&#x306A;&#x30C7;&#x30FC;&#x30BF;&#x69CB;&#x9020;&#x3084;&#x3001;&#x30D5;&#x30A1;&#x30F3;&#x30AF;&#x30BF;&#x30FC;&#x3084;&#x30E2;&#x30CA;&#x30C9;&#x3068;&#x3044;&#x3063;&#x305F;&#x578B;&#x30AF;&#x30E9;&#x30B9;&#x3068;&#x305D;&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30BF;&#x30F3;&#x30B9;&#x3092;&#x63D0;&#x4F9B;&#x3059;&#x308B;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x306E;&#x3053;&#x3068;&#x3002;<a href="#reffn_2" title="Jump back to footnote [2] in the text."> &#x21A9;</a>
</blockquote>

                                
                                </section>
                            
                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="introduction-to-scala.html" class="navigation navigation-next navigation-unique" aria-label="Next page: Scalaとは">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Introduction","level":"1.1","depth":1,"next":{"title":"Scalaとは","level":"1.2","depth":1,"path":"introduction-to-scala.md","ref":"introduction-to-scala.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-search","include-codeblock","japanese-support","footnote-string-to-number","anchors","regexplace"],"root":"./gitbook","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"regexplace":{"substitutes":[{"pattern":"<!-- begin answer id=\"(.*)\" style=\"(.*)\" -->","flags":"g","substitute":"<div><button type=\"button\" id=\"$1_show_answer_button\" style=\"display:block\" onclick=\"document.getElementById('$1').style.display='block'; document.getElementById('$1_show_answer_button').style.display='none'; document.getElementById('$1_hide_answer_button').style.display='block'; \">解答例を表示する</button><button type=\"button\" id=\"$1_hide_answer_button\" style=\"display:none\" onclick=\"document.getElementById('$1').style.display='none'; document.getElementById('$1_show_answer_button').style.display='block'; document.getElementById('$1_hide_answer_button').style.display='none'; \">解答例を隠す</button></div><div id=\"$1\" style=\"$2\">"},{"pattern":"<!-- end answer -->","flags":"g","substitute":"</div>"}]},"footnote-string-to-number":{},"lunr":{"maxIndexSize":1000000},"fontsettings":{"theme":"white","family":"sans","size":2},"japanese-support":{},"highlight":{},"include-codeblock":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchors":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"INTRODUCTION.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Scala研修テキスト","gitbook":"*"},"file":{"path":"INTRODUCTION.md","mtime":"2016-08-08T14:02:52.948Z","type":"markdown"},"gitbook":{"version":"3.1.1","time":"2016-08-08T14:05:37.087Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

